studies/study6/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (gas liquid);

gas
{
    type            purePhaseModel;

    diameterModel   IATE;

    IATECoeffs
    {
        dMax            1e-2;
        dMin            1e-4;

        residualAlpha   1e-4;

        sources
        (
            wakeEntrainmentCoalescence
            {
                Cwe             0.002;
            }

            randomCoalescence
            {
                Crc             0.01;
                C               3;
                alphaMax        0.75;
            }

            turbulentBreakUp
            {
                Cti             0.085;
                WeCr            3;
            }
        );
    }

    residualAlpha   1e-6;
}

liquid
{
    type            purePhaseModel;

    diameterModel   none;

    residualAlpha   1e-6;
}

blending
{
    default
    {
        type            continuous;
        phase           liquid;
    }
}

surfaceTension
{
    gas_liquid
    {
        type            constant;
        sigma           0.00176574;
    }
}

// ************************************************************************* //
